
import { Cycle } from './types';

export const MOROCCAN_SYSTEM = {
  [Cycle.PREP]: {
    levels: ['الأولى إعدادي', 'الثانية إعدادي', 'الثالثة إعدادي'],
    tracks: ['مسار عام', 'مسار دولي (خيار فرنسية)'],
    subjects: {
      'مسار عام': ['الرياضيات', 'الفيزياء والكيمياء', 'علوم الحياة والأرض', 'اللغة العربية', 'التربية الإسلامية', 'الاجتماعيات', 'اللغة الفرنسية', 'التكنولوجيا'],
      'مسار دولي (خيار فرنسية)': ['Mathématiques', 'Physique-Chimie', 'SVT', 'اللغة العربية', 'التربية الإسلامية', 'الاجتماعيات', 'Français']
    }
  },
  [Cycle.SECONDARY]: {
    levels: ['جذع مشترك', 'الأولى باكالوريا', 'الثانية باكالوريا'],
    tracks: [
      'علوم رياضية',
      'علوم تجريبية',
      'علوم فيزيائية',
      'علوم الحياة والأرض',
      'آداب وعلوم إنسانية',
      'علوم اقتصادية وتدبير',
      'العلوم والتكنولوجيات الميكانيكية',
      'العلوم والتكنولوجيات الكهربائية'
    ],
    subjects: {
      'علوم رياضية': ['الرياضيات', 'الفيزياء والكيمياء', 'علوم الحياة والأرض', 'التربية الإسلامية', 'الفلسفة', 'اللغة العربية', 'اللغة الإنجليزية', 'اللغة الفرنسية'],
      'علوم تجريبية': ['الفيزياء والكيمياء', 'علوم الحياة والأرض', 'الرياضيات', 'التربية الإسلامية', 'الفلسفة', 'اللغة العربية', 'اللغة الإنجليزية'],
      'علوم فيزيائية': ['الفيزياء والكيمياء', 'علوم الحياة والأرض', 'الرياضيات', 'التربية الإسلامية', 'الفلسفة', 'اللغة الإنجليزية'],
      'علوم الحياة والأرض': ['علوم الحياة والأرض', 'الفيزياء والكيمياء', 'الرياضيات', 'التربية الإسلامية', 'الفلسفة', 'اللغة الإنجليزية'],
      'آداب وعلوم إنسانية': ['اللغة العربية', 'الفلسفة', 'التاريخ والجغرافيا', 'التربية الإسلامية', 'اللغة الإنجليزية', 'اللغة الفرنسية'],
      'علوم اقتصادية وتدبير': ['الاقتصاد والتدبير', 'المحاسبة', 'الرياضيات', 'التربية الإسلامية', 'الفلسفة', 'الإنجليزية'],
      'العلوم والتكنولوجيات الميكانيكية': ['علوم المهندس', 'الرياضيات', 'الفيزياء والكيمياء', 'التربية الإسلامية', 'الفلسفة'],
      'العلوم والتكنولوجيات الكهربائية': ['علوم المهندس', 'الرياضيات', 'الفيزياء والكيمياء', 'التربية الإسلامية', 'الفلسفة']
    }
  }
};
